src/Documents/ОшибкиТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОшибкиТестирования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ксТесты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ксОшибкиТестов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйРазработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.status</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>start</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>stop</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ОшибкиТестирования/Ext/ManagerModule.bsl
Функция ЗагрузитьДанныеВДокумент(СтруктураЗаписи) Экспорт
	
	Ошибка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОшибкиТестирования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОшибкиТестирования КАК ОшибкиТестирования
	|ГДЕ
	|	ОшибкиТестирования.uuid = &uuid
	|	И ОшибкиТестирования.Тест = &Тест
	|	И ОшибкиТестирования.ИБ = &ИБ
	|	И ОшибкиТестирования.Метаданные = &Метаданные
	|	И ОшибкиТестирования.Ошибка = &Ошибка
	|	И НЕ ОшибкиТестирования.ПометкаУдаления
	|	И ОшибкиТестирования.status = &status
	|	И ОшибкиТестирования.start = &start
	|	И ОшибкиТестирования.stop = &stop";
	
	Запрос.УстановитьПараметр("uuid", СтруктураЗаписи.uuid);
	Запрос.УстановитьПараметр("ИБ", СтруктураЗаписи.ИБ);
	Запрос.УстановитьПараметр("Метаданные", СтруктураЗаписи.Метаданные);
	Запрос.УстановитьПараметр("Ошибка", СтруктураЗаписи.Ошибка);
	Запрос.УстановитьПараметр("Тест", СтруктураЗаписи.Тест);
	Запрос.УстановитьПараметр("status", СтруктураЗаписи.status);
	Запрос.УстановитьПараметр("start", СтруктураЗаписи.start);
	Запрос.УстановитьПараметр("stop", СтруктураЗаписи.stop);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если не ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		// SD-55296 Klevin V.D. 2023/12/29 (
		Если ТипЗнч(СтруктураЗаписи.Ошибка) = Тип("СправочникСсылка.ксОшибкиТестов") Тогда  
			
			ДО = Документы.ОшибкиТестирования.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(до,СтруктураЗаписи);
			
			Попытка
				до.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Ошибка = Истина;
				ОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				ЗаписьЖурналаРегистрации("ОшибкиТестирования.Запись",УровеньЖурналаРегистрации.Ошибка,Метаданные.Документы.ОшибкиТестирования,,ОписаниеОшибки);		
			КонецПопытки;
			
		КонецЕсли; //)
	
	КонецЕсли;
	
		Возврат Ошибка;	
	
КонецФункции
